<!-- terraform cdk action for options with hash 89626a10706fa01ff1451da27e7d2a5d -->
### ✅ Successfully planned Terraform CDK Stack 'graasp-dev'



<details><summary>Show Plan</summary>

```shell
npm WARN deprecated @npmcli/ci-detect@1.4.0: this package has been deprecated, use `ci-info` instead
graasp-dev  Initializing the backend...
graasp-dev  Successfully configured the backend "s3"! Terraform will automatically
            use this backend unless the backend configuration changes.
graasp-dev  Initializing modules...
graasp-dev  Downloading registry.terraform.io/terraform-aws-modules/rds/aws 6.3.0 for graasp-dev-etherpad-postgres_db_17D31B7A...
graasp-dev  - graasp-dev-etherpad-postgres_db_17D31B7A in .terraform/modules/graasp-dev-etherpad-postgres_db_17D31B7A
graasp-dev  - graasp-dev-etherpad-postgres_db_17D31B7A.db_instance in .terraform/modules/graasp-dev-etherpad-postgres_db_17D31B7A/modules/db_instance
graasp-dev  - graasp-dev-etherpad-postgres_db_17D31B7A.db_instance_role_association in .terraform/modules/graasp-dev-etherpad-postgres_db_17D31B7A/modules/db_instance_role_association
            - graasp-dev-etherpad-postgres_db_17D31B7A.db_option_group in .terraform/modules/graasp-dev-etherpad-postgres_db_17D31B7A/modules/db_option_group
            - graasp-dev-etherpad-postgres_db_17D31B7A.db_parameter_group in .terraform/modules/graasp-dev-etherpad-postgres_db_17D31B7A/modules/db_parameter_group
            - graasp-dev-etherpad-postgres_db_17D31B7A.db_subnet_group in .terraform/modules/graasp-dev-etherpad-postgres_db_17D31B7A/modules/db_subnet_group
graasp-dev  Downloading registry.terraform.io/terraform-aws-modules/rds/aws 6.3.0 for graasp-dev-postgres_db_F1D5DB7A...
graasp-dev  - graasp-dev-postgres_db_F1D5DB7A in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A
graasp-dev  - graasp-dev-postgres_db_F1D5DB7A.db_instance in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A/modules/db_instance
graasp-dev  - graasp-dev-postgres_db_F1D5DB7A.db_instance_role_association in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A/modules/db_instance_role_association
            - graasp-dev-postgres_db_F1D5DB7A.db_option_group in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A/modules/db_option_group
graasp-dev  - graasp-dev-postgres_db_F1D5DB7A.db_parameter_group in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A/modules/db_parameter_group
            - graasp-dev-postgres_db_F1D5DB7A.db_subnet_group in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A/modules/db_subnet_group
graasp-dev  Downloading registry.terraform.io/terraform-aws-modules/vpc/aws 5.2.0 for vpc...
graasp-dev  - vpc in .terraform/modules/vpc
graasp-dev  Initializing provider plugins...
graasp-dev  - Finding hashicorp/random versions matching ">= 3.1.0"...
graasp-dev  - Finding hashicorp/aws versions matching ">= 5.0.0, >= 5.25.0, 5.25.0"...
graasp-dev  - Installing hashicorp/random v3.5.1...
graasp-dev  - Installed hashicorp/random v3.5.1 (signed by HashiCorp)
graasp-dev  - Installing hashicorp/aws v5.25.0...
graasp-dev  - Installed hashicorp/aws v5.25.0 (signed by HashiCorp)

            Terraform has created a lock file .terraform.lock.hcl to record the provider
            selections it made above. Include this file in your version control repository
            so that Terraform can guarantee to make the same selections by default when
            you run "terraform init" in the future.
graasp-dev  Terraform has been successfully initialized!

            You may now begin working with Terraform. Try running "terraform plan" to see
            any changes that are required for your infrastructure. All Terraform commands
            should now work.

            If you ever set or change modules or backend configuration for Terraform,
            rerun this command to reinitialize your working directory. If you forget, other
            commands will detect it and remind you to do so if necessary.
graasp-dev  - Fetching hashicorp/aws 5.25.0 for linux_amd64...
graasp-dev  - Retrieved hashicorp/aws 5.25.0 for linux_amd64 (signed by HashiCorp)
graasp-dev  - Fetching hashicorp/random 3.5.1 for linux_amd64...
graasp-dev  - Retrieved hashicorp/random 3.5.1 for linux_amd64 (signed by HashiCorp)
            - Obtained hashicorp/aws checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
            - Obtained hashicorp/random checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
graasp-dev  Success! Terraform has validated the lock file and found no need for changes.
graasp-dev  module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=FdxyXQ]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=SHBibw]
graasp-dev  data.aws_acm_certificate.graasp-dev-acm-cert (graasp-dev-acm-cert): Reading...
graasp-dev  data.aws_ecr_repository.graasp-dev-etherpad-ecr (graasp-dev-etherpad-ecr): Reading...
graasp-dev  data.aws_ecr_repository.graasp-dev-explore-ecr (graasp-dev-explore-ecr): Reading...
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
            aws_s3_bucket.graasp-dev-file-items_bucket_12606B30 (graasp-dev-file-items/bucket): Refreshing state... [id=graasp-dev-file-items]
            aws_cloudwatch_log_group.graasp-dev_graasp-loggroup_44ECC8C2 (graasp-dev/graasp-loggroup): Refreshing state... [id=/ecs/graasp]
            data.aws_acm_certificate.graasp-dev-acm-cert (graasp-dev-acm-cert)-lb: Reading...
graasp-dev  aws_s3_bucket.graasp-dev-player_bucket_F2A2D347 (graasp-dev-player/bucket): Refreshing state... [id=graasp-dev-player]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
            aws_cloudwatch_log_group.graasp-dev_meilisearch-loggroup_F1AD2775 (graasp-dev/meilisearch-loggroup): Refreshing state... [id=/ecs/meilisearch]
            module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.data.aws_partition.current: Reading...
            module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
            aws_s3_bucket.graasp-dev-apps_bucket_F4170225 (graasp-dev-apps/bucket): Refreshing state... [id=graasp-dev-apps]
graasp-dev  module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
            module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
            aws_cloudwatch_log_group.graasp-dev_etherpad-loggroup_200385B4 (graasp-dev/etherpad-loggroup): Refreshing state... [id=/ecs/etherpad]
graasp-dev  data.aws_acm_certificate.graasp-dev-acm-cert (graasp-dev-acm-cert): Read complete after 2s [id=arn:aws:acm:us-east-1:299720865162:certificate/46cb9d1f-aea8-42de-8232-a5b83f1cc7e2]
graasp-dev  aws_ecs_cluster.cluster (cluster): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:cluster/graasp-dev]
graasp-dev  module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.data.aws_partition.current: Reading...
graasp-dev  module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
graasp-dev  aws_s3_bucket.graasp-dev-admin_bucket_CD8D86EC (graasp-dev-admin/bucket): Refreshing state... [id=graasp-dev-admin]
            module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b312f17d2e08cb6e]
graasp-dev  aws_s3_bucket.graasp-dev-builder_bucket_E21AE40A (graasp-dev-builder/bucket): Refreshing state... [id=graasp-dev-builder]
graasp-dev  data.aws_ecr_repository.graasp-dev-etherpad-ecr (graasp-dev-etherpad-ecr): Read complete after 1s [id=graasp/etherpad]
graasp-dev  aws_iam_role.graasp-dev_ecs-execution-role_A4D135E8 (graasp-dev/ecs-execution-role): Refreshing state... [id=graasp-dev-ecs-execution-role]
graasp-dev  data.aws_acm_certificate.graasp-dev-acm-cert (graasp-dev-acm-cert)-lb: Read complete after 1s [id=arn:aws:acm:eu-central-1:299720865162:certificate/af9d071d-3aa1-4583-905d-ec1efd5515d3]
graasp-dev  aws_s3_bucket.graasp-dev-h5p_bucket_B545A43B (graasp-dev-h5p/bucket): Refreshing state... [id=graasp-dev-h5p]
graasp-dev  aws_s3_bucket.graasp-dev-analytics_bucket_E7907EE2 (graasp-dev-analytics/bucket): Refreshing state... [id=graasp-dev-analytics]
graasp-dev  data.aws_ecr_repository.graasp-dev-explore-ecr (graasp-dev-explore-ecr): Read complete after 1s [id=graasp/explore]
graasp-dev  aws_service_discovery_http_namespace.graasp-dev_namespace_B6F7BA2C (graasp-dev/namespace): Refreshing state... [id=ns-us3rov3ukfoth5ox]
graasp-dev  aws_s3_bucket.graasp-dev-auth_bucket_09E0996B (graasp-dev-auth/bucket): Refreshing state... [id=graasp-dev-auth]
graasp-dev  aws_s3_bucket.graasp-dev-assets_bucket_8930785E (graasp-dev-assets/bucket): Refreshing state... [id=graasp-dev-assets]
graasp-dev  aws_s3_bucket.graasp-dev-maintenance_bucket_46B8FAD7 (graasp-dev-maintenance/bucket): Refreshing state... [id=graasp-dev-maintenance]
graasp-dev  aws_cloudwatch_log_group.graasp-dev_graasp-library-loggroup_FD22B99E (graasp-dev/graasp-library-loggroup): Refreshing state... [id=/ecs/graasp-library]
graasp-dev  aws_s3_bucket.graasp-dev-account_bucket_17879B4C (graasp-dev-account/bucket): Refreshing state... [id=graasp-dev-account]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=graasp-postgres15-20231009123434812500000001]
graasp-dev  data.aws_ecr_repository.graasp-dev-ecr (graasp-dev-ecr): Reading...
graasp-dev  module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=graasp-postgres15-20231009123434818400000002]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=graasp-dev-rds-monitoring-role]
graasp-dev  module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=graasp-dev-etherpad-rds-monitoring-role]
graasp-dev  aws_ecs_task_definition.graasp-dev_meilisearch_38A3D0B6 (graasp-dev/meilisearch): Refreshing state... [id=meilisearch]
graasp-dev  aws_ecs_task_definition.graasp-dev_graasp_54E40EB5 (graasp-dev/graasp): Refreshing state... [id=graasp]
graasp-dev  data.aws_ecr_repository.graasp-dev-ecr (graasp-dev-ecr): Read complete after 1s [id=graasp]
graasp-dev  aws_ecs_task_definition.graasp-dev_graasp-library_B38B90C0 (graasp-dev/graasp-library): Refreshing state... [id=graasp-library]
graasp-dev  module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-06ce6a79ac9494ac3]
graasp-dev  module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0fd249cba5ab4c742]
graasp-dev  module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0de0872c207e953b3]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-file-items_s3-block-public-access_DD6519C0 (graasp-dev-file-items/s3-block-public-access): Refreshing state... [id=graasp-dev-file-items]
graasp-dev  aws_s3_bucket_cors_configuration.graasp-dev-file-items_s3-cors-config_531774F3 (graasp-dev-file-items/s3-cors-config): Refreshing state... [id=graasp-dev-file-items]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-file-items_s3-bucket-ownership_9BB45BB8 (graasp-dev-file-items/s3-bucket-ownership): Refreshing state... [id=graasp-dev-file-items]
graasp-dev  data.aws_iam_policy_document.graasp-dev-apps_allow_public_access_9E010C09 (graasp-dev-apps/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-apps_allow_public_access_9E010C09 (graasp-dev-apps/allow_public_access): Read complete after 0s [id=4070198440]
            aws_s3_bucket_ownership_controls.graasp-dev-apps_s3-bucket-ownership_699CAAD9 (graasp-dev-apps/s3-bucket-ownership): Refreshing state... [id=graasp-dev-apps]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-apps_s3-block-public-access_05DA1D21 (graasp-dev-apps/s3-block-public-access): Refreshing state... [id=graasp-dev-apps]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-apps_s3-website-configuration_7E3F72D4 (graasp-dev-apps/s3-website-configuration): Refreshing state... [id=graasp-dev-apps]
graasp-dev  aws_cloudfront_distribution.graasp-dev-apps-cloudfront (graasp-dev-apps-cloudfront): Refreshing state... [id=E354WPS1CZ652D]
graasp-dev  data.aws_iam_policy_document.graasp-dev-player_allow_public_access_AB634BF6 (graasp-dev-player/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-player_allow_public_access_AB634BF6 (graasp-dev-player/allow_public_access): Read complete after 0s [id=3834136389]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-player_s3-block-public-access_2D924E86 (graasp-dev-player/s3-block-public-access): Refreshing state... [id=graasp-dev-player]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-player_s3-bucket-ownership_C82B0AEE (graasp-dev-player/s3-bucket-ownership): Refreshing state... [id=graasp-dev-player]
graasp-dev  aws_cloudfront_distribution.graasp-dev-player-cloudfront (graasp-dev-player-cloudfront): Refreshing state... [id=E1Q7RJTWCI9MVT]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-player_s3-website-configuration_BA187414 (graasp-dev-player/s3-website-configuration): Refreshing state... [id=graasp-dev-player]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-admin_s3-website-configuration_982EB24B (graasp-dev-admin/s3-website-configuration): Refreshing state... [id=graasp-dev-admin]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-admin_s3-block-public-access_CE38E6EE (graasp-dev-admin/s3-block-public-access): Refreshing state... [id=graasp-dev-admin]
graasp-dev  aws_cloudfront_distribution.graasp-dev-admin-cloudfront (graasp-dev-admin-cloudfront): Refreshing state... [id=EJQRECLT1CFKT]
graasp-dev  data.aws_iam_policy_document.graasp-dev-admin_allow_public_access_C4AD10BD (graasp-dev-admin/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-admin_allow_public_access_C4AD10BD (graasp-dev-admin/allow_public_access): Read complete after 0s [id=4244781079]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-admin_s3-bucket-ownership_E2B795DE (graasp-dev-admin/s3-bucket-ownership): Refreshing state... [id=graasp-dev-admin]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-builder_s3-block-public-access_E82A62FB (graasp-dev-builder/s3-block-public-access): Refreshing state... [id=graasp-dev-builder]
graasp-dev  data.aws_iam_policy_document.graasp-dev-builder_allow_public_access_17867863 (graasp-dev-builder/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-builder_allow_public_access_17867863 (graasp-dev-builder/allow_public_access): Read complete after 0s [id=2027949331]
graasp-dev  aws_cloudfront_distribution.graasp-dev-builder-cloudfront (graasp-dev-builder-cloudfront): Refreshing state... [id=E3K2C3E7VQ5L5R]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-builder_s3-website-configuration_AE8DACB7 (graasp-dev-builder/s3-website-configuration): Refreshing state... [id=graasp-dev-builder]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-builder_s3-bucket-ownership_32C20CD8 (graasp-dev-builder/s3-bucket-ownership): Refreshing state... [id=graasp-dev-builder]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=graasp-dev-rds-monitoring-role-20231009123438644600000004]
graasp-dev  aws_s3_bucket_cors_configuration.graasp-dev-h5p_s3-cors-config_EC778FA8 (graasp-dev-h5p/s3-cors-config): Refreshing state... [id=graasp-dev-h5p]
graasp-dev  data.aws_iam_policy_document.graasp-dev-h5p_allow_public_access_04C01E9A (graasp-dev-h5p/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-h5p_allow_public_access_04C01E9A (graasp-dev-h5p/allow_public_access): Read complete after 0s [id=1897348743]
            aws_s3_bucket_public_access_block.graasp-dev-h5p_s3-block-public-access_2D472005 (graasp-dev-h5p/s3-block-public-access): Refreshing state... [id=graasp-dev-h5p]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-h5p_s3-bucket-ownership_418B795B (graasp-dev-h5p/s3-bucket-ownership): Refreshing state... [id=graasp-dev-h5p]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-h5p_s3-website-configuration_5FB93898 (graasp-dev-h5p/s3-website-configuration): Refreshing state... [id=graasp-dev-h5p]
graasp-dev  aws_cloudfront_distribution.graasp-dev-h5p-cloudfront (graasp-dev-h5p-cloudfront): Refreshing state... [id=E3B7XJV46O4VB4]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-analytics_s3-block-public-access_D50BFCBF (graasp-dev-analytics/s3-block-public-access): Refreshing state... [id=graasp-dev-analytics]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-analytics_s3-bucket-ownership_60A2F232 (graasp-dev-analytics/s3-bucket-ownership): Refreshing state... [id=graasp-dev-analytics]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-analytics_s3-website-configuration_395CAD4F (graasp-dev-analytics/s3-website-configuration): Refreshing state... [id=graasp-dev-analytics]
graasp-dev  data.aws_iam_policy_document.graasp-dev-analytics_allow_public_access_7EB98E21 (graasp-dev-analytics/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-analytics_allow_public_access_7EB98E21 (graasp-dev-analytics/allow_public_access): Read complete after 0s [id=994142342]
graasp-dev  aws_cloudfront_distribution.graasp-dev-analytics-cloudfront (graasp-dev-analytics-cloudfront): Refreshing state... [id=E23F4UJ5WUYDK0]
graasp-dev  aws_security_group.graasp-dev-library-security-group (graasp-dev-library-security-group): Refreshing state... [id=sg-07bae39853af00427]
graasp-dev  aws_security_group.graasp-dev-postgres_graasp-dev-db-security-group_6A637215 (graasp-dev-postgres/graasp-dev-db-security-group): Refreshing state... [id=sg-009f5a0d494264c65]
graasp-dev  aws_security_group.graasp-dev-meilisearch-security-group (graasp-dev-meilisearch-security-group): Refreshing state... [id=sg-0799aa7fb5fcd7d3c]
graasp-dev  aws_security_group.graasp-dev-etherpad-postgres_graasp-dev-etherpad-db-security-group_5536552C (graasp-dev-etherpad-postgres/graasp-dev-etherpad-db-security-group): Refreshing state... [id=sg-013be41be980f2c86]
graasp-dev  aws_security_group.graasp-dev-backend-security-group (graasp-dev-backend-security-group): Refreshing state... [id=sg-014f1fd084973fd06]
graasp-dev  aws_security_group.graasp-dev-etherpad-security-group (graasp-dev-etherpad-security-group): Refreshing state... [id=sg-0ffb7f564703627af]
graasp-dev  aws_security_group.graasp-dev-lb-security-group (graasp-dev-lb-security-group): Refreshing state... [id=sg-0f07f40e7da03b966]
graasp-dev  aws_security_group.graasp-dev-redis_graasp-dev-redis-security-group_726BAF0A (graasp-dev-redis/graasp-dev-redis-security-group): Refreshing state... [id=sg-028d965f91f27e896]
graasp-dev  aws_security_group.graasp-dev-postgres_graasp-dev-gatekeeper-security-group_5E5090D6 (graasp-dev-postgres/graasp-dev-gatekeeper-security-group): Refreshing state... [id=sg-0c2ff9adba744d2e0]
graasp-dev  module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=graasp-dev-etherpad-rds-monitoring-role-20231009123439796700000005]
graasp-dev  module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-055a0124ce88123b2]
graasp-dev  module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-01f44d93731acccb7]
graasp-dev  module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0596b784e2da6e5c6]
graasp-dev  module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-09991359fa2a53c1c]
graasp-dev  module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-01955c8cc5f6d5181]
graasp-dev  aws_cloudfront_distribution.graasp-dev-auth-cloudfront (graasp-dev-auth-cloudfront): Refreshing state... [id=E3QXD6029ZLRUC]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-auth_s3-website-configuration_47B58E1B (graasp-dev-auth/s3-website-configuration): Refreshing state... [id=graasp-dev-auth]
graasp-dev  data.aws_iam_policy_document.graasp-dev-auth_allow_public_access_0D0CE7D9 (graasp-dev-auth/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-auth_allow_public_access_0D0CE7D9 (graasp-dev-auth/allow_public_access): Read complete after 0s [id=138587570]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-auth_s3-block-public-access_61A2029D (graasp-dev-auth/s3-block-public-access): Refreshing state... [id=graasp-dev-auth]
            aws_s3_bucket_ownership_controls.graasp-dev-auth_s3-bucket-ownership_5182BB9F (graasp-dev-auth/s3-bucket-ownership): Refreshing state... [id=graasp-dev-auth]
graasp-dev  aws_s3_bucket_policy.graasp-dev-apps_s3-policy_708B7B00 (graasp-dev-apps/s3-policy): Refreshing state... [id=graasp-dev-apps]
graasp-dev  data.aws_iam_policy_document.graasp-dev-assets_allow_public_access_59580A32 (graasp-dev-assets/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-assets_allow_public_access_59580A32 (graasp-dev-assets/allow_public_access): Read complete after 0s [id=661570887]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-assets_s3-bucket-ownership_1BE1C46A (graasp-dev-assets/s3-bucket-ownership): Refreshing state... [id=graasp-dev-assets]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-assets_s3-block-public-access_D15DF7EF (graasp-dev-assets/s3-block-public-access): Refreshing state... [id=graasp-dev-assets]
graasp-dev  aws_cloudfront_distribution.graasp-dev-assets-cloudfront (graasp-dev-assets-cloudfront): Refreshing state... [id=E1TTPMNH8QPMJP]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-assets_s3-website-configuration_6D1735B5 (graasp-dev-assets/s3-website-configuration): Refreshing state... [id=graasp-dev-assets]
graasp-dev  aws_s3_bucket_policy.graasp-dev-player_s3-policy_79B5A424 (graasp-dev-player/s3-policy): Refreshing state... [id=graasp-dev-player]
graasp-dev  aws_s3_bucket_policy.graasp-dev-admin_s3-policy_1AE743F7 (graasp-dev-admin/s3-policy): Refreshing state... [id=graasp-dev-admin]
graasp-dev  aws_s3_bucket_policy.graasp-dev-builder_s3-policy_0743ACD6 (graasp-dev-builder/s3-policy): Refreshing state... [id=graasp-dev-builder]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-maintenance_s3-website-configuration_50149944 (graasp-dev-maintenance/s3-website-configuration): Refreshing state... [id=graasp-dev-maintenance]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-maintenance_s3-block-public-access_C8FD87F8 (graasp-dev-maintenance/s3-block-public-access): Refreshing state... [id=graasp-dev-maintenance]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-maintenance_s3-bucket-ownership_1588A828 (graasp-dev-maintenance/s3-bucket-ownership): Refreshing state... [id=graasp-dev-maintenance]
graasp-dev  aws_cloudfront_distribution.graasp-dev-maintenance-cloudfront (graasp-dev-maintenance-cloudfront): Refreshing state... [id=EGBVR5KHBTMNX]
graasp-dev  data.aws_iam_policy_document.graasp-dev-maintenance_allow_public_access_8F6F3848 (graasp-dev-maintenance/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-maintenance_allow_public_access_8F6F3848 (graasp-dev-maintenance/allow_public_access): Read complete after 0s [id=2448502661]
graasp-dev  aws_s3_bucket_policy.graasp-dev-h5p_s3-policy_9DB0282E (graasp-dev-h5p/s3-policy): Refreshing state... [id=graasp-dev-h5p]
graasp-dev  aws_s3_bucket_policy.graasp-dev-analytics_s3-policy_47751E84 (graasp-dev-analytics/s3-policy): Refreshing state... [id=graasp-dev-analytics]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-library-allow-all (graasp-dev-library-allow-all): Refreshing state... [id=sgr-03cd64d6e8521413a]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-postgres_graasp-dev-db-allow-all_0D9DEE53 (graasp-dev-postgres/graasp-dev-db-allow-all): Refreshing state... [id=sgr-0199bcbb086d17111]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-meilisearch-allow-all (graasp-dev-meilisearch-allow-all): Refreshing state... [id=sgr-05069d1371837adba]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-etherpad-postgres_graasp-dev-etherpad-db-allow-all_5F6AD39A (graasp-dev-etherpad-postgres/graasp-dev-etherpad-db-allow-all): Refreshing state... [id=sgr-086eaaa92175b65c3]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-postgres_graasp-dev-db-allow-load-balancer_B5379AF7 (graasp-dev-postgres/graasp-dev-db-allow-load-balancer): Refreshing state... [id=sgr-0e918dedbcdfaf5a3]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-backend-allow-all (graasp-dev-backend-allow-all): Refreshing state... [id=sgr-0f70a895b80fd309e]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-meilisearch-allow-load-balancer (graasp-dev-meilisearch-allow-load-balancer): Refreshing state... [id=sgr-0badbb62b413edf8f]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-etherpad-allow-all (graasp-dev-etherpad-allow-all): Refreshing state... [id=sgr-06470ffe6a0df1219]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-etherpad-postgres_graasp-dev-etherpad-db-allow-load-balancer_F7923A38 (graasp-dev-etherpad-postgres/graasp-dev-etherpad-db-allow-load-balancer): Refreshing state... [id=sgr-04f60bbc71ad25532]
graasp-dev  data.aws_iam_policy_document.graasp-dev-account_allow_public_access_4663AEFE (graasp-dev-account/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-account_allow_public_access_4663AEFE (graasp-dev-account/allow_public_access): Read complete after 1s [id=2163471972]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-account_s3-bucket-ownership_66A731F2 (graasp-dev-account/s3-bucket-ownership): Refreshing state... [id=graasp-dev-account]
graasp-dev  aws_cloudfront_distribution.graasp-dev-account-cloudfront (graasp-dev-account-cloudfront): Refreshing state... [id=E3AQ3WOWQG30WK]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-account_s3-website-configuration_6ECAAB4F (graasp-dev-account/s3-website-configuration): Refreshing state... [id=graasp-dev-account]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-account_s3-block-public-access_882CFDD8 (graasp-dev-account/s3-block-public-access): Refreshing state... [id=graasp-dev-account]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-backend-allow-load-balancer (graasp-dev-backend-allow-load-balancer): Refreshing state... [id=sgr-0f1f4d5674dff4695]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-load-balancer_allow-http-ipv6_91743348 (graasp-dev-load-balancer/allow-http-ipv6): Refreshing state... [id=sgr-084bba5f4b221f189]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-load-balancer_allow-https_0223BC47 (graasp-dev-load-balancer/allow-https): Refreshing state... [id=sgr-0d7110664852fbdc7]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-load-balancer_allow-http_0E987E63 (graasp-dev-load-balancer/allow-http): Refreshing state... [id=sgr-0dbd5cad25b6a1a87]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-etherpad-allow-load-balancer (graasp-dev-etherpad-allow-load-balancer): Refreshing state... [id=sgr-06e2e5786d9ade6fb]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-library-allow-load-balancer (graasp-dev-library-allow-load-balancer): Refreshing state... [id=sgr-04e219db366df9a40]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-load-balancer_graasp-dev-allow-all_001EC5EB (graasp-dev-load-balancer/graasp-dev-allow-all): Refreshing state... [id=sgr-08d13e43e33fd5b5a]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-load-balancer_allow-https-ipv6_DC496355 (graasp-dev-load-balancer/allow-https-ipv6): Refreshing state... [id=sgr-023719db02da6a2a8]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-redis_graasp-dev-redis-allow-all_ED3B9B56 (graasp-dev-redis/graasp-dev-redis-allow-all): Refreshing state... [id=sgr-0c1da168f3e9c7c2a]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-redis_graasp-dev-redis-allow-load-balancer_7AAB0A26 (graasp-dev-redis/graasp-dev-redis-allow-load-balancer): Refreshing state... [id=sgr-0c3d730d5b9274660]
graasp-dev  aws_s3_bucket_policy.graasp-dev-auth_s3-policy_E1D1F49B (graasp-dev-auth/s3-policy): Refreshing state... [id=graasp-dev-auth]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-postgres_graasp-dev-gatekeeper-allow-all_F4CA82DF (graasp-dev-postgres/graasp-dev-gatekeeper-allow-all): Refreshing state... [id=sgr-044d40ce135cc808c]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-allow-gatekeeper (graasp-dev-allow-gatekeeper): Refreshing state... [id=sgr-0b4583f54fb611142]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-postgres_graasp-dev-gatekeeper_graasp-dev-gatekeeper-allow-inbound-ssh_F2AAE5EF (graasp-dev-postgres/graasp-dev-gatekeeper/graasp-dev-gatekeeper-allow-inbound-ssh): Refreshing state... [id=sgr-04319f87f3529386b]
graasp-dev  aws_s3_bucket_policy.graasp-dev-assets_s3-policy_B5DD3F7D (graasp-dev-assets/s3-policy): Refreshing state... [id=graasp-dev-assets]
graasp-dev  module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ba3fbc906b89068b]
graasp-dev  module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-065b7c3d10a5adb5f]
graasp-dev  module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0953114662597b70b]
graasp-dev  module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-09991359fa2a53c1c1080289494]
graasp-dev  aws_s3_bucket_policy.graasp-dev-maintenance_s3-policy_DA8583B1 (graasp-dev-maintenance/s3-policy): Refreshing state... [id=graasp-dev-maintenance]
graasp-dev  aws_s3_bucket_policy.graasp-dev-account_s3-policy_02771A3D (graasp-dev-account/s3-policy): Refreshing state... [id=graasp-dev-account]
graasp-dev  aws_ecs_service.graasp-dev_meilisearch-service_3A736F80 (graasp-dev/meilisearch-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/meilisearch]
graasp-dev  aws_lb.graasp-dev-load-balancer_lb_9A06B77C (graasp-dev-load-balancer/lb): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:loadbalancer/app/graasp-dev/2d9df8ffedc22275]
graasp-dev  aws_elasticache_subnet_group.graasp-dev-redis_graasp-dev-redis-subnet-group_E192F4DD (graasp-dev-redis/graasp-dev-redis-subnet-group): Refreshing state... [id=graasp-dev]
graasp-dev  aws_instance.graasp-dev-postgres_graasp-dev-gatekeeper_graasp-dev-gatekeeper-ec2_805D7592 (graasp-dev-postgres/graasp-dev-gatekeeper/graasp-dev-gatekeeper-ec2): Refreshing state... [id=i-040a58250b4a6263d]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_subnet_group.aws_db_subnet_group.this[0]: Refreshing state... [id=graasp-dev-20231009123833192500000015]
graasp-dev  module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_subnet_group.aws_db_subnet_group.this[0]: Refreshing state... [id=graasp-dev-etherpad-20231009123833124600000014]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=graasp-dev]
graasp-dev  module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=graasp-dev-etherpad]
graasp-dev  aws_ecs_task_definition.graasp-dev_etherpad_D664EB2D (graasp-dev/etherpad): Refreshing state... [id=etherpad]
graasp-dev  aws_lb_listener.graasp-dev-load-balancer_lb-listener-https_E069C227 (graasp-dev-load-balancer/lb-listener-https): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener/app/graasp-dev/2d9df8ffedc22275/416636dae9d8bda4]
graasp-dev  aws_lb_listener.graasp-dev-load-balancer_lb-listener-http-redirect_309E2C64 (graasp-dev-load-balancer/lb-listener-http-redirect): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener/app/graasp-dev/2d9df8ffedc22275/9cc00852f3f90d6a]
graasp-dev  aws_elasticache_cluster.graasp-dev-redis_C864F0E3 (graasp-dev-redis/graasp-dev-redis): Refreshing state... [id=graasp-dev-redis]
graasp-dev  aws_lb_listener_rule.graasp-dev-load-balancer_graasp-dev-shortener_2A4B0FBC (graasp-dev-load-balancer/graasp-dev-shortener): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/2d9df8ffedc22275/416636dae9d8bda4/a0a229972dcce063]
            aws_lb_target_group.graasp-dev_graasp-target-group_7E05BC31 (graasp-dev/graasp-target-group): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/graasp/75b2cf400edd1909]
graasp-dev  aws_lb_target_group.graasp-dev_graasp-library-target-group_47035354 (graasp-dev/graasp-library-target-group): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/graasp-library/1f502836d98e92e0]
            aws_lb_target_group.graasp-dev_etherpad-target-group_94F8091C (graasp-dev/etherpad-target-group): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/etherpad/69fe8f88d1211cfe]
graasp-dev  aws_ecs_service.graasp-dev_etherpad-service_366B5CFC (graasp-dev/etherpad-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/etherpad]
graasp-dev  aws_lb_listener_rule.graasp-dev_etherpad-rule_74CA3679 (graasp-dev/etherpad-rule): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/2d9df8ffedc22275/416636dae9d8bda4/d95b5f32dc661338]
graasp-dev  aws_lb_listener_rule.graasp-dev_graasp-rule_8589AD50 (graasp-dev/graasp-rule): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/2d9df8ffedc22275/416636dae9d8bda4/5bba1be112990e2f]
graasp-dev  aws_ecs_service.graasp-dev_graasp-service_BD538BD2 (graasp-dev/graasp-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/graasp]
graasp-dev  aws_lb_listener_rule.graasp-dev_graasp-library-rule_AC381C09 (graasp-dev/graasp-library-rule): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/2d9df8ffedc22275/416636dae9d8bda4/47b6511ce97bab5a]
graasp-dev  aws_ecs_service.graasp-dev_graasp-library-service_35621E15 (graasp-dev/graasp-library-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/graasp-library]
graasp-dev  aws_appautoscaling_target.graasp-dev_graasp-service-autoscaling-target_517CCDCE (graasp-dev/graasp-service-autoscaling-target): Refreshing state... [id=service/graasp-dev/graasp]
graasp-dev  aws_appautoscaling_target.graasp-dev_graasp-library-service-autoscaling-target_5E0ABD4D (graasp-dev/graasp-library-service-autoscaling-target): Refreshing state... [id=service/graasp-dev/graasp-library]
graasp-dev  aws_appautoscaling_policy.graasp-dev_graasp-service-autoscaling-policy_70C429DA (graasp-dev/graasp-service-autoscaling-policy): Refreshing state... [id=graasp]
graasp-dev  aws_appautoscaling_policy.graasp-dev_graasp-library-service-autoscaling-policy_E718A88F (graasp-dev/graasp-library-service-autoscaling-policy): Refreshing state... [id=graasp-library]
graasp-dev  Terraform used the selected providers to generate the following execution
            plan. Resource actions are indicated with the following symbols:
              ~ update in-place
            -/+ destroy and then create replacement

            Terraform will perform the following actions:
graasp-dev  # aws_elasticache_cluster.graasp-dev-redis_C864F0E3 (graasp-dev-redis/graasp-dev-redis) will be updated in-place
              ~ resource "aws_elasticache_cluster" "graasp-dev-redis_C864F0E3" {
                    id                         = "graasp-dev-redis"
                  ~ node_type                  = "cache.t2.micro" -> "cache.t3.micro"
                    tags                       = {}
                    # (22 unchanged attributes hidden)
                }

              # aws_instance.graasp-dev-postgres_graasp-dev-gatekeeper_graasp-dev-gatekeeper-ec2_805D7592 (graasp-dev-postgres/graasp-dev-gatekeeper/graasp-dev-gatekeeper-ec2) must be replaced
            -/+ resource "aws_instance" "graasp-dev-postgres_graasp-dev-gatekeeper_graasp-dev-gatekeeper-ec2_805D7592" {
                  ~ arn                                  = "arn:aws:ec2:eu-central-1:299720865162:instance/i-040a58250b4a6263d" -> (known after apply)
                  ~ associate_public_ip_address          = false -> true # forces replacement
                  ~ availability_zone                    = "eu-central-1a" -> (known after apply)
                  ~ cpu_core_count                       = 1 -> (known after apply)
                  ~ cpu_threads_per_core                 = 1 -> (known after apply)
                  ~ disable_api_stop                     = false -> (known after apply)
                  ~ disable_api_termination              = false -> (known after apply)
                  ~ ebs_optimized                        = false -> (known after apply)
                  - hibernation                          = false -> null
                  + host_id                              = (known after apply)
                  + host_resource_group_arn              = (known after apply)
                  + iam_instance_profile                 = (known after apply)
                  ~ id                                   = "i-040a58250b4a6263d" -> (known after apply)
                  ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
                  + instance_lifecycle                   = (known after apply)
                  ~ instance_state                       = "stopped" -> (known after apply)
                  ~ ipv6_address_count                   = 0 -> (known after apply)
                  ~ ipv6_addresses                       = [] -> (known after apply)
                  ~ monitoring                           = false -> (known after apply)
                  + outpost_arn                          = (known after apply)
                  + password_data                        = (known after apply)
                  + placement_group                      = (known after apply)
                  ~ placement_partition_number           = 0 -> (known after apply)
                  ~ primary_network_interface_id         = "eni-0a89d986636e95ace" -> (known after apply)
                  ~ private_dns                          = "ip-172-32-1-52.eu-central-1.compute.internal" -> (known after apply)
                  ~ private_ip                           = "172.32.1.52" -> (known after apply)
                  + public_dns                           = (known after apply)
                  + public_ip                            = (known after apply)
                  ~ secondary_private_ips                = [] -> (known after apply)
                  ~ security_groups                      = [] -> (known after apply)
                  + spot_instance_request_id             = (known after apply)
                    tags                                 = {
                        "Name" = "graasp-dev-gatekeeper"
                    }
                  ~ tenancy                              = "default" -> (known after apply)
                  + user_data                            = (known after apply)
                  + user_data_base64                     = (known after apply)
                    # (9 unchanged attributes hidden)

                  - capacity_reservation_specification {
                      - capacity_reservation_preference = "open" -> null
                    }

                  - cpu_options {
                      - core_count       = 1 -> null
                      - threads_per_core = 1 -> null
                    }

                  - credit_specification {
                      - cpu_credits = "standard" -> null
                    }

                  - enclave_options {
                      - enabled = false -> null
                    }

                  - maintenance_options {
                      - auto_recovery = "default" -> null
                    }

                  - metadata_options {
                      - http_endpoint               = "enabled" -> null
                      - http_protocol_ipv6          = "disabled" -> null
                      - http_put_response_hop_limit = 2 -> null
                      - http_tokens                 = "required" -> null
                      - instance_metadata_tags      = "disabled" -> null
                    }

                  - private_dns_name_options {
                      - enable_resource_name_dns_a_record    = false -> null
                      - enable_resource_name_dns_aaaa_record = false -> null
                      - hostname_type                        = "ip-name" -> null
                    }

                  - root_block_device {
                      - delete_on_termination = true -> null
                      - device_name           = "/dev/xvda" -> null
                      - encrypted             = false -> null
                      - iops                  = 3000 -> null
                      - tags                  = {} -> null
                      - throughput            = 125 -> null
                      - volume_id             = "vol-02c8f7db05f33acfa" -> null
                      - volume_size           = 8 -> null
                      - volume_type           = "gp3" -> null
                    }
                }

              # module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.aws_db_instance.this[0] will be updated in-place
              ~ resource "aws_db_instance" "this" {
                  ~ engine_version                        = "15.2" -> "15.3"
                    id                                    = "graasp-dev-etherpad"
                    tags                                  = {}
                    # (56 unchanged attributes hidden)

                    # (1 unchanged block hidden)
                }

              # module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.aws_db_instance.this[0] will be updated in-place
              ~ resource "aws_db_instance" "this" {
                  ~ engine_version                        = "15.2" -> "15.3"
                    id                                    = "graasp-dev"
                    tags                                  = {}
                    # (56 unchanged attributes hidden)

                    # (1 unchanged block hidden)
                }

            Plan: 1 to add, 3 to change, 1 to destroy.

            ─────────────────────────────────────────────────────────────────────────────

            Saved the plan to: plan

            To perform exactly these actions, run the following command to apply:
                terraform apply "plan"


```

</details>